base/DataProcessors/бит_ИнформационнаяПанель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ИнформационнаяПанель</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект системы, по которому выводится информация</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

base/DataProcessors/бит_ИнформационнаяПанель/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
 
Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

Перем мВалютаУправленческогоУчета Экспорт; // Хранит валюту управленческого учета.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выводит информацию по данному объекту в табличный документ.
// 
// Параметры:
//  ТД  - ТабличныйДокумент.
// 
Процедура ОбновитьИнформацию(ДокументРезультат) Экспорт

	ДокументРезультат.Очистить();
	ДокументРезультат.НачатьАвтоГруппировкуСтрок();
	Макет = ПолучитьМакет("Макет");
	
	ОблМакетаЗаголовок = Макет.ПолучитьОбласть("ЗаголовокИнформация");
	
	Если ЗначениеЗаполнено(Объект) И ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		ОблМакетаЗаголовок.Параметры.Заголовок = Строка(Объект.ДокументПланирования);
		ДокументРезультат.Вывести(ОблМакетаЗаголовок);
		ДеревоИнформация = ПолучитьИнформациюПоЗаявке();
		ВывестиСтрокуДерева(ДеревоИнформация,Макет,ДокументРезультат);	
		
	ИначеЕсли ЗначениеЗаполнено(Объект) И (ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
		  ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию")
		  ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")) Тогда

		ОблМакетаЗаголовок.Параметры.Заголовок = Строка(Объект);
		ДокументРезультат.Вывести(ОблМакетаЗаголовок);
		ДеревоИнформация = ПолучитьИнформациюПоЗаявке();
		ВывестиСтрокуДерева(ДеревоИнформация,Макет,ДокументРезультат);
		
	Иначе	
	   ДокументРезультат.Вывести(ОблМакетаЗаголовок);		
	   ОблМакета=Макет.ПолучитьОбласть("СтрокаИнформация");		
	   ОблМакета.Параметры.ИмяПараметра = НСтр("ru='По данному объекту нет дополнительной информации';
	   										   |en='There is no additional information on this property.'");
	   ДокументРезультат.Вывести(ОблМакета);
	КонецЕсли; 

	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ЗакончитьАвтоГруппировкуСтрок();
	
КонецПроцедуры

// Функция формирует дерево с инфомацией по документу общая заявка.
// 
// Возвращаемое значение:
//   ДеревоИнформация   - ДеревоЗначений.
// 
Функция ПолучитьИнформациюПоОбщейЗаявке() Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	Возврат Неопределено;
	// -- ЕРП 
	
КонецФункции

// Функция формирует дерево с инфомацией по документу заявка.
// 
// Возвращаемое значение:
//   ДеревоИнформация   - ДеревоЗначений.
// 
Функция ПолучитьИнформациюПоЗаявке() Экспорт

	ВалютаДокумента = Объект.ВалютаДокумента;
	
	ДеревоИнформация = Новый ДеревоЗначений;
	ДеревоИнформация.Колонки.Добавить("ЭтоГруппа",Новый ОписаниеТипов("Булево"));
	ДеревоИнформация.Колонки.Добавить("ИмяПараметра");
	ДеревоИнформация.Колонки.Добавить("ЗначениеПараметра");
	ДеревоИнформация.Колонки.Добавить("Имя");
	
	// Суммы по документу.
	СтрокаГруппа = ДеревоИнформация.Строки.Добавить();
	СтрокаГруппа.Имя          = "СуммаДокумента";
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Суммы документа';en='Document total amounts'");
	СтрокаГруппа.ЭтоГруппа    = Истина;
		
	СуммаДокумента = 0;
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		СуммаДокумента = Объект.СуммаДокумента;	
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументПланирования", Объект);
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ЕСТЬNULL(СУММА(ТабДок.СуммаДокумента), 0) КАК СуммаДокумента
		        |ИЗ
		        |	Документ.бит_кзн_ПлатежнаяПозиция КАК ТабДок
		        |ГДЕ
		        |	ТабДок.ДокументПланирования = &ДокументПланирования";
					   
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаДокумента = Выборка.СуммаДокумента;	
		КонецЦикла; 
	КонецЕсли; 
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма документа:';en='Document total amount:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(СуммаДокумента, ВалютаДокумента, "0,00");	
	
	КурсыВалютДокумента = бит_Бюджетирование.КурсыВалютСценария(Объект, Объект.Дата,
								Новый Структура("Документ, Регл, Упр, Сценарий"));

	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма (регл.):';en='Amount (Regla.):'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(бит_КурсыВалют.ПересчитатьДокРегл(СуммаДокумента, КурсыВалютДокумента), мВалютаРегламентированногоУчета, "0,00");
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма (упр.):';en='Sum (Ex.):'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(бит_КурсыВалют.ПересчитатьДокУпр(СуммаДокумента, КурсыВалютДокумента), мВалютаУправленческогоУчета, "0,00");
	
	// Сведения об оплате.
	СтрокаГруппа = ДеревоИнформация.Строки.Добавить();
	СтрокаГруппа.Имя          = "СведенияОбОплате";
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Сведения об оплате';en='Payment Details'");
	СтрокаГруппа.ЭтоГруппа    = Истина;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
	
		РезСтруктура 	= Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПолучитьОстаток(Объект);
		СуммаКОплате 	= РезСтруктура.План;
		Оплачено 		= РезСтруктура.Факт;
		Остаток 		= РезСтруктура.Остаток;
		
	Иначе	
	
		РезСтруктура 	= Документы.бит_кзн_ПлатежнаяПозиция.ПолучитьОстаток(Объект);
		СуммаКОплате 	= РезСтруктура.План;
		Оплачено 		= РезСтруктура.Факт;
		Остаток 		= РезСтруктура.Остаток;
		
	КонецЕсли;	
		
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='К оплате:';en='For payment:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(СуммаКОплате, Объект.ВалютаДокумента, "0,00");
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Оплачено:';en='Paid:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(Оплачено, Объект.ВалютаДокумента, "0,00");

	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Остаток:';en='Balance:'");
	СтрокаДерева.ЗначениеПараметра =  бит_ОбщегоНазначения.ФорматСумм(Остаток, Объект.ВалютаДокумента, "0,00");
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	// Получим настройки пользователя.
	ВыводитьСведенияОЛимитах 		= бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ВыводитьСведенияОЛимитахДляЗаявки",
										ТекПользователь);
	ВыводитьСведенияОВзаиморасчетах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ВыводитьСведенияОВзаиморасчетахДляЗаявки",
										ТекПользователь);
	Если ВыводитьСведенияОЛимитах Тогда																					  
		// Добавим сведения об остатках по бюджету.
		
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
			
			ПлатежныеПозиции = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Объект).МассивПозиций;
			МассивСтатей = Новый Массив;
			Для каждого ПлатежнаяПозиция Из ПлатежныеПозиции Цикл
				ДобавитьСведенияОКонтрольныхЗначенияхБюджета(ДеревоИнформация.Строки, ПлатежнаяПозиция);
			КонецЦикла; 
		Иначе	
			ДобавитьСведенияОКонтрольныхЗначенияхБюджета(ДеревоИнформация.Строки, Объект);		
		КонецЕсли;	
	КонецЕсли;
	
	Если ВыводитьСведенияОВзаиморасчетах Тогда
		// Добавим сведения по взаиморасчетам.
		ДобавитьСведенияПоВзаиморасчетам(ДеревоИнформация.Строки);
	КонецЕсли;
	
	ДобавитьСведенияПоКорректировкамКонтрольныхЗначений(ДеревоИнформация.Строки);
	
	Возврат ДеревоИнформация;

КонецФункции

// Функция формирует дерево с информацией по документу заявка на затраты.
// 
// Возвращаемое значение:
//   ДеревоИнформация   - ДеревоЗначений.
// 
Функция ПолучитьИнформациюПоЗаявкеНаЗатраты() Экспорт

	ВалютаДокумента = Объект.ВалютаДокумента;
	
	ДеревоИнформация = Новый ДеревоЗначений;
	ДеревоИнформация.Колонки.Добавить("ЭтоГруппа",Новый ОписаниеТипов("Булево"));
	ДеревоИнформация.Колонки.Добавить("ИмяПараметра");
	ДеревоИнформация.Колонки.Добавить("ЗначениеПараметра");
	ДеревоИнформация.Колонки.Добавить("Имя");
	
	// Суммы по документу.
	СтрокаГруппа = ДеревоИнформация.Строки.Добавить();
	СтрокаГруппа.Имя          = "СуммаДокумента";
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Суммы документа';en='Document total amounts'");
	СтрокаГруппа.ЭтоГруппа    = Истина; 
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма документа:';en='Document total amount:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(Объект.Сумма, ВалютаДокумента, "0,00");	
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма (регл.):';en='Amount (Regla.):'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(Объект.СуммаРегл, мВалютаРегламентированногоУчета, "0,00");
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Сумма (упр.):';en='Sum (Ex.):'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(Объект.СуммаУпр, мВалютаУправленческогоУчета, "0,00");
	
	// Сведения о выполнении.
	СтрокаГруппа = ДеревоИнформация.Строки.Добавить();
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Сведения о выполнении';en='Implementation Details'");
	СтрокаГруппа.ЭтоГруппа    = Истина;
	               
	РезСтруктура = бит_Договоры.ПолучитьЗатратыПоЗаявке(Объект);
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='К затратам:';en='To cost:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(РезСтруктура.СуммаПлан, Объект.ВалютаДокумента, "0,00");
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Выполнено:';en='Completed'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(РезСтруктура.СуммаЗатраты, Объект.ВалютаДокумента, "0,00");

	Если ЗначениеЗаполнено(РезСтруктура.СуммаЗакрыта) Тогда
		
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Закрыто:';en='Closed:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(РезСтруктура.СуммаЗакрыта, Объект.ВалютаДокумента, "0,00");
		
	КонецЕсли;
	
	СтрокаДерева = СтрокаГруппа.Строки.Добавить();
	СтрокаДерева.ИмяПараметра = НСтр("ru='Остаток:';en='Balance:'");
	СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(РезСтруктура.Разность, Объект.ВалютаДокумента, "0,00");
	
	ДобавитьСведенияПоКорректировкамКонтрольныхЗначений(ДеревоИнформация.Строки);
	
	Возврат ДеревоИнформация;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выводит в табличный документ строку дерева значений. Рекурсивный вызов.
// 
// Параметры:
//  СтартоваяСтрока  - КоллекцияСтрокДереваЗначений.
//  Макет - Макет.
//  ТД    - ТабличныйДокумент.
// 
Процедура ВывестиСтрокуДерева(СтартоваяСтрока, Макет, ДокументРезультат)
	
	Для каждого СтрокаДерева Из СтартоваяСтрока.Строки Цикл
		УровеньГруппировки =  СтрокаДерева.Уровень() + 1;
		Если УровеньГруппировки = 1 Тогда
			ОблМакета = Макет.ПолучитьОбласть("Разделитель");	
			ДокументРезультат.Вывести(ОблМакета, 1);
		КонецЕсли;
		
		Если НЕ СтрокаДерева.ЭтоГруппа Тогда
			ОблМакета = Макет.ПолучитьОбласть("СтрокаИнформация");
		Иначе	
			ИмяОбласти = "ГруппировкаИнформация" + УровеньГруппировки;
			ОблМакета = Макет.ПолучитьОбласть(ИмяОбласти);
		КонецЕсли; 
		
		ОблМакета.Параметры.ИмяПараметра = СтрокаДерева.ИмяПараметра;
		
		Если НЕ СтрокаДерева.ЭтоГруппа Тогда
			ОблМакета.Параметры.ЗначениеПараметра = СтрокаДерева.ЗначениеПараметра;
		КонецЕсли; 
		
		ДокументРезультат.Вывести(ОблМакета, УровеньГруппировки);
		
		ВывестиСтрокуДерева(СтрокаДерева,Макет,ДокументРезультат)
		
	КонецЦикла; 

КонецПроцедуры

// Процедура добавляет сведения об остатках по бюджету.
// 
// Параметры:
//  СтрокиДереваИнформации - СтрокиДереваЗначений.
// 
Процедура ДобавитьСведенияОКонтрольныхЗначенияхБюджета(СтрокиДереваИнформации, ПлатежнаяПозиция)
	
	ПараметрыДокумента = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(ПлатежнаяПозиция, Ложь);
	
	ИнформацияОбОстатках = бит_КонтрольИсполненияБюджета.ПрогнозИсполненияБюджета(
								ПараметрыДокумента.ИсполнениеБюджета, ПараметрыДокумента.ИсполнениеБюджетаРеквизиты);
	ПрогнозИсполненияБюджета = ИнформацияОбОстатках.ПрогнозИсполненияБюджета;
	
	// Остатки по бюджету.
	СтрокаГруппа = СтрокиДереваИнформации.Добавить();
	СтрокаГруппа.Имя          = "ОстаткиПобюджету";
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Остатки по бюджету';en='Budget balances'");
	СтрокаГруппа.ЭтоГруппа    = Истина; 
			
	Если НЕ ЗначениеЗаполнено(ПрогнозИсполненияБюджета) Тогда
		Если ПараметрыДокумента.ИсполнениеБюджетаРеквизиты.Количество() = 0 Тогда
			ВалютаСценария = ПараметрыДокумента.Реквизиты.ВалютаСценария;
		Иначе
			ВалютаСценария = ПараметрыДокумента.ИсполнениеБюджетаРеквизиты[0].ВалютаСценария;
		КонецЕсли;
		// Выведем пустые суммы.
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Нач. остаток:';en='Initial balance:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(0, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Исполнение:';en='Execution:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(0, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Сверх лимита:';en='Over the limit:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(0, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Кон. остаток:';en='Final balance:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(0, ВалютаСценария, "0,00");
	Иначе
		
		Запрос = Новый Запрос(); 
		Запрос.УстановитьПараметр("ИнформацияОбОстатках",ПрогнозИсполненияБюджета);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнформацияОбОстатках.НомерСтроки КАК НомерСтроки,
		|	ИнформацияОбОстатках.ЦФО КАК ЦФО,
		|	ИнформацияОбОстатках.СтатьяОборотов КАК СтатьяОборотов,
		|	ИнформацияОбОстатках.СценарийКонтролируемый КАК СценарийКонтролируемый,
		|	ИнформацияОбОстатках.Аналитика_1 КАК Аналитика_1,
		|	ИнформацияОбОстатках.Аналитика_2 КАК Аналитика_2,
		|	ИнформацияОбОстатках.Аналитика_3 КАК Аналитика_3,
		|	ИнформацияОбОстатках.Аналитика_4 КАК Аналитика_4,
		|	ИнформацияОбОстатках.Аналитика_5 КАК Аналитика_5,
		|	ИнформацияОбОстатках.Аналитика_6 КАК Аналитика_6,
		|	ИнформацияОбОстатках.Аналитика_7 КАК Аналитика_7,
		|	ИнформацияОбОстатках.Аналитика_8 КАК Аналитика_8,
		|	ИнформацияОбОстатках.Аналитика_9 КАК Аналитика_9,
		|	ИнформацияОбОстатках.Аналитика_10 КАК Аналитика_10,
		|	ИнформацияОбОстатках.Аналитика_11 КАК Аналитика_11,
		|	ИнформацияОбОстатках.Аналитика_12 КАК Аналитика_12,
		|	ИнформацияОбОстатках.СуммаНачОстаток КАК НачОстаток,
		|	ИнформацияОбОстатках.СуммаИсполнение КАК Исполнение,
		|	ИнформацияОбОстатках.СуммаСверхЛимита КАК СверхЛимита,
		|	ИнформацияОбОстатках.СуммаКонОстаток КАК КонОстаток
		|ПОМЕСТИТЬ ИнформацияОбОстатках
		|ИЗ
		|	&ИнформацияОбОстатках КАК ИнформацияОбОстатках
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияОбОстатках.НомерСтроки КАК НомерСтроки,
		|	ИнформацияОбОстатках.ЦФО КАК ЦФО,
		|	ИнформацияОбОстатках.СтатьяОборотов КАК СтатьяОборотов,
		|	ИнформацияОбОстатках.СценарийКонтролируемый КАК СценарийКонтролируемый,
		|	ИнформацияОбОстатках.Аналитика_1 КАК Аналитика_1,
		|	ИнформацияОбОстатках.Аналитика_2 КАК Аналитика_2,
		|	ИнформацияОбОстатках.Аналитика_3 КАК Аналитика_3,
		|	ИнформацияОбОстатках.Аналитика_4 КАК Аналитика_4,
		|	ИнформацияОбОстатках.Аналитика_5 КАК Аналитика_5,
		|	ИнформацияОбОстатках.Аналитика_6 КАК Аналитика_6,
		|	ИнформацияОбОстатках.Аналитика_7 КАК Аналитика_7,
		|	ИнформацияОбОстатках.Аналитика_8 КАК Аналитика_8,
		|	ИнформацияОбОстатках.Аналитика_9 КАК Аналитика_9,
		|	ИнформацияОбОстатках.Аналитика_10 КАК Аналитика_10,
		|	ИнформацияОбОстатках.Аналитика_11 КАК Аналитика_11,
		|	ИнформацияОбОстатках.Аналитика_12 КАК Аналитика_12,
		|	СУММА(ИнформацияОбОстатках.НачОстаток) КАК НачОстаток,
		|	СУММА(ИнформацияОбОстатках.Исполнение) КАК Исполнение,
		|	СУММА(ИнформацияОбОстатках.СверхЛимита) КАК СверхЛимита,
		|	СУММА(ИнформацияОбОстатках.КонОстаток) КАК КонОстаток
		|ИЗ
		|	ИнформацияОбОстатках КАК ИнформацияОбОстатках
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнформацияОбОстатках.НомерСтроки,
		|	ИнформацияОбОстатках.СценарийКонтролируемый,
		|	ИнформацияОбОстатках.СтатьяОборотов,
		|	ИнформацияОбОстатках.ЦФО,
		|	ИнформацияОбОстатках.Аналитика_1,
		|	ИнформацияОбОстатках.Аналитика_2,
		|	ИнформацияОбОстатках.Аналитика_3,
		|	ИнформацияОбОстатках.Аналитика_4,
		|	ИнформацияОбОстатках.Аналитика_5,
		|	ИнформацияОбОстатках.Аналитика_6,
		|	ИнформацияОбОстатках.Аналитика_7,
		|	ИнформацияОбОстатках.Аналитика_8,
		|	ИнформацияОбОстатках.Аналитика_9,
		|	ИнформацияОбОстатках.Аналитика_10,
		|	ИнформацияОбОстатках.Аналитика_11,
		|	ИнформацияОбОстатках.Аналитика_12";

		// Сформируем массив имен аналитики для формирования строки бюджета.
		Аналитики = Новый Массив;
		Аналитики.Добавить("ЦФО");
		Аналитики.Добавить("СтатьяОборотов");
		Аналитики.Добавить("СценарийКонтролируемый");
		Аналитики.Добавить("Аналитика_1");
		Аналитики.Добавить("Аналитика_2");
		Аналитики.Добавить("Аналитика_3");
		Аналитики.Добавить("Аналитика_4");
		Аналитики.Добавить("Аналитика_5");
		Аналитики.Добавить("Аналитика_6");
		Аналитики.Добавить("Аналитика_7");
		Аналитики.Добавить("Аналитика_8");
		Аналитики.Добавить("Аналитика_9");
		Аналитики.Добавить("Аналитика_10");
		Аналитики.Добавить("Аналитика_11");
		Аналитики.Добавить("Аналитика_12");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Выведем данные остатков по бюджету.
		ВывестиДанныеОстатковПоБюджетам(РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам)
									   ,СтрокаГруппа
									   ,ВалютаСценария
									   ,Аналитики);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выводит данные остатков по бюджету. Рекурсивный вызов.
// 
// Параметры:
//  СтрокаГруппа     - СтрокаДереваЗначений.
//  ВыборкаИзЗапроса - ВыборкаИзЗапроса.
// 
Процедура ВывестиДанныеОстатковПоБюджетам(ВыборкаИзЗапроса, СтрокаГруппа, ВалютаСценария, МассивАналитик)
	
	Пока ВыборкаИзЗапроса.Следующий() Цикл
		СтрокаПодГруппа = СтрокаГруппа.Строки.Добавить();
		СтрокаПодГруппа.ИмяПараметра = СформироватьПредставлениеАналитик(ВыборкаИзЗапроса, МассивАналитик);
		СтрокаПодГруппа.ЭтоГруппа	 = Истина;
		
		// Контролируемая.
		СтрокаДерева = СтрокаПодГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра 	   = НСтр("ru='Контролируемая статья';en='Controlled article'");
		СтрокаДерева.ЗначениеПараметра = НЕ ВыборкаИзЗапроса.СтатьяОборотов.НеКонтролировать_Заявки;
		
		СтрокаДерева = СтрокаПодГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Нач. остаток:';en='Initial balance:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапроса.НачОстаток, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаПодГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Исполнение:';en='Execution:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапроса.Исполнение, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаПодГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Сверх лимита:';en='Over the limit:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапроса.СверхЛимита, ВалютаСценария, "0,00");
		
		СтрокаДерева = СтрокаПодГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = НСтр("ru='Кон. остаток:';en='Final balance:'");
		СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(ВыборкаИзЗапроса.КонОстаток, ВалютаСценария, "0,00");
	КонецЦикла;
	
КонецПроцедуры

// Функция формирует представление аналитики остатка по бюджету.
// 
// Параметры:
//  ВыборкаИзЗапроса - ВыборкаИзЗапроса.
//  МассивАналитик   - Массив.
// 
// Возвращаемое значение:
//  Представление - Строка.
// 
Функция СформироватьПредставлениеАналитик(ВыборкаИзЗапроса, МассивАналитик)
	
	Представление = "";
	
	Для Каждого ТекИмяАналитики Из МассивАналитик Цикл
		
		ТекЗначениеАналитики = ВыборкаИзЗапроса[ТекИмяАналитики];
		
		Если ЗначениеЗаполнено(ТекЗначениеАналитики) Тогда
			
			Представление = Представление + ?(ПустаяСтрока(Представление), "", "/") + Строка(ТекЗначениеАналитики);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

// Процедура добавляет сведения по документам КорректировкаКонтрольныхЗначений.
// 
Процедура ДобавитьСведенияПоКорректировкамКонтрольныхЗначений(СтрокиДереваИнформации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_КорректировкаКонтрольныхЗначений.Ссылка
	|ИЗ
	|	Документ.бит_КорректировкаКонтрольныхЗначений КАК бит_КорректировкаКонтрольныхЗначений
	|ГДЕ
	|	бит_КорректировкаКонтрольныхЗначений.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект);
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	СтрокаГруппа = СтрокиДереваИнформации.Добавить();
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Корректировки контрольных значений';en='Control value adjustments'");
	СтрокаГруппа.ЭтоГруппа    = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДерева = СтрокаГруппа.Строки.Добавить();
		СтрокаДерева.ИмяПараметра = Выборка.Ссылка;
		СтрокаДерева.ЭтоГруппа	  = Истина;
		
	КонецЦикла;
	
КонецПроцедуры
	
// Процедура добавляет сведения по взаиморасчетам.
// 
// Параметры:
//  СтрокиДереваИнформации - СтрокиДереваЗначений.
// 
Процедура ДобавитьСведенияПоВзаиморасчетам(СтрокиДереваИнформации)
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыБухгалтерии.Хозрасчетный) Тогда
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		ЗаявкаРС = Объект;	
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
		И ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		ЗаявкаРС = Объект.ДокументПланирования;
		
		Если ЗначениеЗаполнено(Объект.ОбъектРасчетов) Тогда
			ДоговорКонтрагента = Неопределено;
			Если ТипЗнч(Объект.ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				ДоговорКонтрагента = Объект.ОбъектРасчетов;
			Иначе
				МетаОбъектаРасчетов = Объект.ОбъектРасчетов.Метаданные();
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаОбъектаРасчетов) Тогда
					ДоговорКонтрагента = Объект.ОбъектРасчетов.Договор;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
				МассивДоговоров.Добавить(ДоговорКонтрагента);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаРС.ДоговорСЗаказчиком) Тогда
		МассивДоговоров.Добавить(ЗаявкаРС.ДоговорСЗаказчиком);
	КонецЕсли;
	
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивДоговоров, Истина);
	
	ПараметрыЗапроса = ПараметрыЗапросаВзаиморасчетов(ЗаявкаРС, МассивДоговоров);
	РезультатЗапроса = РезультатЗапросаПоВзаиморасчетам(ПараметрыЗапроса);
	
	// Данные по взаиморасчетам.
	СтрокаГруппа = СтрокиДереваИнформации.Добавить();
	СтрокаГруппа.ИмяПараметра = НСтр("ru='Взаиморасчеты';en='Mutual settlements'");
	СтрокаГруппа.ЭтоГруппа    = Истина;
	
	Если РезультатЗапроса.Пустой() Тогда
		СтрокаПодГруппа = СтрокаГруппа.Строки.Добавить();
		СтрокаПодГруппа.ИмяПараметра = НСтр("ru='Задолженность отсутствует';en='No debt'");
		СтрокаПодГруппа.ЭтоГруппа	 = Ложь;
		Возврат;
	КонецЕсли;
	
	// Сформируем структуру префиксов остатков.
	СтруктураПрефиксов = Новый Структура;
	СтруктураПрефиксов.Вставить("Дт", НСтр("ru='Дебиторская задолженность';en='Accounts receivable'"));
	СтруктураПрефиксов.Вставить("Кт", НСтр("ru='Кредиторская задолженность';en='Accounts payable'"));
	
	ВыборкаПоДоговорам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
	
	Пока ВыборкаПоДоговорам.Следующий() Цикл
		
		ТекДоговор 			 = ВыборкаПоДоговорам.Договор;
		ВалютаВзаиморасчетов = ВыборкаПоДоговорам.ВалютаВзаиморасчетов;
		Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		// Выведем суммы.
		СтрокаПодГруппа = СтрокаГруппа.Строки.Добавить();
		СтрокаПодГруппа.ИмяПараметра = ?(ЗначениеЗаполнено(ТекДоговор), Строка(ТекДоговор), "<без договора>");
		СтрокаПодГруппа.ЭтоГруппа	 = Истина;
		
		ВыборкаПоСчетам = ВыборкаПоДоговорам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Счет");
		
		Пока ВыборкаПоСчетам.Следующий() Цикл
			
			Для Каждого КлючЗначение Из СтруктураПрефиксов Цикл
				
				ТекСумма = ВыборкаПоСчетам["Ост" + КлючЗначение.Ключ];
				
				Если Не ТекСумма = 0 Тогда
					
					НайденнаяСтрока = СтрокаПодГруппа.Строки.Найти(КлючЗначение.Значение, "ИмяПараметра");
					
					Если НайденнаяСтрока = Неопределено Тогда
						СтрокаГруппаСчетов = СтрокаПодГруппа.Строки.Добавить();
						СтрокаГруппаСчетов.ИмяПараметра = КлючЗначение.Значение;
						СтрокаГруппаСчетов.ЭтоГруппа	= Истина;
					Иначе
						СтрокаГруппаСчетов = НайденнаяСтрока;
					КонецЕсли;
					
					КурсКратностьВалюты = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, ПараметрыЗапроса.Период);
						
					СуммаВВалютеВзаиморасчетов = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ТекСумма
													, мВалютаРегламентированногоУчета, ВалютаВзаиморасчетов
													, 1, КурсКратностьВалюты.Курс, 1, КурсКратностьВалюты.Кратность);
					
					СтрокаДерева = СтрокаГруппаСчетов.Строки.Добавить();
					СтрокаДерева.ИмяПараметра 	   = Строка(ВыборкаПоСчетам.Счет);
					СтрокаДерева.ЗначениеПараметра = бит_ОбщегоНазначения.ФорматСумм(СуммаВВалютеВзаиморасчетов
														, ВалютаВзаиморасчетов, "0,00");
					
				КонецЕсли;
				
			КонецЦикла; // СтруктураПрефиксов.
			
		КонецЦикла; // ВыборкаПоСчетам.
		
	КонецЦикла; // ВыборкаПоДоговорам. 
	
КонецПроцедуры
 
Функция ПараметрыЗапросаВзаиморасчетов(ДокументСсылка, МассивДоговоров)
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("МассивДоговоров",     МассивДоговоров);
	Параметры.Вставить("Контрагент",          ДокументСсылка.Контрагент);
	Параметры.Вставить("Организация",         ДокументСсылка.Организация);
	Параметры.Вставить("Период",              ТекущаяДатаСеанса());
	Параметры.Вставить("ПоКонтрагентуВЦелом", (МассивДоговоров.Количество() = 0));
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками); // Счет 60
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками); // Счет 62
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам); // Счет 63
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам); // Счет 66
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам); // Счет 67
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами); // Счет 76
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПредоставленныеЗаймы); // Счет 58.03
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВкладыПоДоговоруПростогоТоварищества); // Счет 58.04
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретенныеПрава); // Счет 58.05
	Параметры.Вставить("МассивСчетов", МассивСчетов);
	
	Возврат Параметры;
	
КонецФункции

Функция РезультатЗапросаПоВзаиморасчетам(ПараметрыЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстДт,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет В ИЕРАРХИИ (&МассивСчетов),
	|			,
	|			Организация = &Организация
	|				И Субконто2 В (&МассивДоговоров)) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	(ХозрасчетныйОстатки.СуммаОстатокДт <> 0
	|			ИЛИ ХозрасчетныйОстатки.СуммаОстатокКт <> 0)
	|ИТОГИ
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	СУММА(ОстДт),
	|	СУММА(ОстКт)
	|ПО
	|	Договор,
	|	Счет";
	Если ПараметрыЗапроса.ПоКонтрагентуВЦелом Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Субконто2 В (&МассивДоговоров)", "Субконто1 = &Контрагент");
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагент",      ПараметрыЗапроса.Контрагент);
	Запрос.УстановитьПараметр("МассивДоговоров", ПараметрыЗапроса.МассивДоговоров); 
	Запрос.УстановитьПараметр("Организация",     ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("Период",          ПараметрыЗапроса.Период);
	Запрос.УстановитьПараметр("МассивСчетов",    ПараметрыЗапроса.МассивСчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область Инициализация

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
мВалютаУправленческогоУчета     = Константы.бит_ВалютаУправленческогоУчета.Получить();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
